ciaa/firmware_v1/externals/drivers/msp430/inc/msp430fr68891.h
/* ESITSM Control Bits */
#define ESIDIV3B0_L         (0x0080)      /* TSM start trigger ACLK divider */
#define ESIDIV3A2_L         (0x0040)      /* TSM start trigger ACLK divider */
#define ESIDIV3A1_L         (0x0020)      /* TSM start trigger ACLK divider */
#define ESIDIV3A0_L         (0x0010)      /* TSM start trigger ACLK divider */
#define ESIDIV21_L          (0x0008)      /* ACLK divider */
#define ESIDIV20_L          (0x0004)      /* ACLK divider */
#define ESIDIV11_L          (0x0002)      /* TSM SMCLK divider */
#define ESIDIV10_L          (0x0001)      /* TSM SMCLK divider */

/* ESITSM Control Bits */
#define ESICLKAZSEL_H       (0x0040)      /* Functionality selection of ESITSMx bit5 */
#define ESITSMTRG1_H        (0x0020)      /* TSM start trigger selection */
#define ESITSMTRG0_H        (0x0010)      /* TSM start trigger selection */
#define ESISTART_H          (0x0008)      /* TSM software start trigger */
#define ESITSMRP_H          (0x0004)      /* TSM repeat modee */
#define ESIDIV3B2_H         (0x0002)      /* TSM start trigger ACLK divider */
#define ESIDIV3B1_H         (0x0001)      /* TSM start trigger ACLK divider */

#define ESITSMTRG_0         (0x0000)      /* Halt mode */
#define ESITSMTRG_1         (0x1000)      /* TSM start trigger ACLK divider */
#define ESITSMTRG_2         (0x2000)      /* Software trigger for TSM */
#define ESITSMTRG_3         (0x3000)      /* Either the ACLK divider or the ESISTART biT */
#define ESIDIV3B_0          (0x0000)      /* TSM start trigger ACLK divider */
#define ESIDIV3B_1          (0x0080)      /* TSM start trigger ACLK divider */
#define ESIDIV3B_2          (0x0100)      /* TSM start trigger ACLK divider */
#define ESIDIV3B_3          (0x0180)      /* TSM start trigger ACLK divider */
#define ESIDIV3B_4          (0x0200)      /* TSM start trigger ACLK divider */
#define ESIDIV3B_5          (0x0280)      /* TSM start trigger ACLK divider */
#define ESIDIV3B_6          (0x0300)      /* TSM start trigger ACLK divider */
#define ESIDIV3B_7          (0x0380)      /* TSM start trigger ACLK divider */
#define ESIDIV3A_0          (0x0000)      /* TSM start trigger ACLK divider */
#define ESIDIV3A_1          (0x0010)      /* TSM start trigger ACLK divider */
#define ESIDIV3A_2          (0x0020)      /* TSM start trigger ACLK divider */
#define ESIDIV3A_3          (0x0030)      /* TSM start trigger ACLK divider */
#define ESIDIV3A_4          (0x0040)      /* TSM start trigger ACLK divider */
#define ESIDIV3A_5          (0x0050)      /* TSM start trigger ACLK divider */
#define ESIDIV3A_6          (0x0060)      /* TSM start trigger ACLK divider */
#define ESIDIV3A_7          (0x0070)      /* TSM start trigger ACLK divider */
#define ESIDIV2_0           (0x0000)      /* ACLK divider mode: 0 */
#define ESIDIV2_1           (0x0004)      /* ACLK divider mode: 1 */
#define ESIDIV2_2           (0x0008)      /* ACLK divider mode: 2 */
#define ESIDIV2_3           (0x000C)      /* ACLK divider mode: 3 */
#define ESIDIV2__1          (0x0000)      /* ACLK divider = /1 */
#define ESIDIV2__2          (0x0004)      /* ACLK divider = /2 */
#define ESIDIV2__4          (0x0008)      /* ACLK divider = /4 */
#define ESIDIV2__8          (0x000C)      /* ACLK divider = /8 */
#define ESIDIV1_0           (0x0000)      /* TSM SMCLK/ESIOSC divider mode: 0 */
#define ESIDIV1_1           (0x0001)      /* TSM SMCLK/ESIOSC divider mode: 1 */
#define ESIDIV1_2           (0x0002)      /* TSM SMCLK/ESIOSC divider mode: 2 */
#define ESIDIV1_3           (0x0003)      /* TSM SMCLK/ESIOSC divider mode: 3 */
#define ESIDIV1__1          (0x0000)      /* TSM SMCLK/ESIOSC divider = /1 */
#define ESIDIV1__2          (0x0001)      /* TSM SMCLK/ESIOSC divider = /2 */
#define ESIDIV1__4          (0x0002)      /* TSM SMCLK/ESIOSC divider = /4 */
#define ESIDIV1__8          (0x0003)      /* TSM SMCLK/ESIOSC divider = /8 */

/* ESIPSM Control Bits */
#define ESICNT2RST          (0x8000)      /* ESI Counter 2 reset */
#define ESICNT1RST          (0x4000)      /* ESI Counter 1 reset */
#define ESICNT0RST          (0x2000)      /* ESI Counter 0 reset */
#define ESITEST4SEL1        (0x0200)      /* Output signal selection for SIFTEST4 pin */
#define ESITEST4SEL0        (0x0100)      /* Output signal selection for SIFTEST4 pin */
#define ESIV2SEL            (0x0080)      /* Source Selection for V2 bit*/
#define ESICNT2EN           (0x0020)      /* ESICNT2 enable (down counter) */
#define ESICNT1EN           (0x0010)      /* ESICNT1 enable (up/down counter) */
#define ESICNT0EN           (0x0008)      /* ESICNT0 enable (up counter) */
#define ESIQ7TRG            (0x0004)      /* Enabling to use Q7 as trigger for a TSM sequence */
#define ESIQ6EN             (0x0001)      /* Q6 enable */

/* ESIPSM Control Bits */
#define ESIV2SEL_L          (0x0080)      /* Source Selection for V2 bit*/
#define ESICNT2EN_L         (0x0020)      /* ESICNT2 enable (down counter) */
#define ESICNT1EN_L         (0x0010)      /* ESICNT1 enable (up/down counter) */
#define ESICNT0EN_L         (0x0008)      /* ESICNT0 enable (up counter) */
#define ESIQ7TRG_L          (0x0004)      /* Enabling to use Q7 as trigger for a TSM sequence */
#define ESIQ6EN_L           (0x0001)      /* Q6 enable */

/* ESIPSM Control Bits */
#define ESICNT2RST_H        (0x0080)      /* ESI Counter 2 reset */
#define ESICNT1RST_H        (0x0040)      /* ESI Counter 1 reset */
#define ESICNT0RST_H        (0x0020)      /* ESI Counter 0 reset */
#define ESITEST4SEL1_H      (0x0002)      /* Output signal selection for SIFTEST4 pin */
#define ESITEST4SEL0_H      (0x0001)      /* Output signal selection for SIFTEST4 pin */

#define ESITEST4SEL_0       (0x0000)      /* Q1 signal from PSM table */
#define ESITEST4SEL_1       (0x0100)      /* Q2 signal from PSM table */
#define ESITEST4SEL_2       (0x0200)      /* TSM clock signal from Timing State Machine */
#define ESITEST4SEL_3       (0x0300)      /* AFE1's comparator output signal Comp1Out */

